package dynamic_programming;

/** 금광
 * n x m 크기의 금광이 있다. 금광은 1 x 1 크기의 칸으로 나누어져 있으며,
 * 각 칸은 특정한 크기의 금이 들어 있다.
 * 채굴자는 첫 번째 열부터 출발하여 금을 캐기 시작한다. 맨 처음에는 첫 번째 열의 어느 행에서든 출발할 수 있다.
 * 이후에 m - 1 번에 걸쳐서 매번 오른쪽 위, 오른쪽, 오른쪽 아래 3가지 중 하나의 위치로 이동해야 한다.
 * 결과적으로 채굴자가 얻을 수 있는 금의 최대 크기를 출력하세요.
 *
 * 입력:
 * 첫째 줄에 테스트 케이스 T가 입력된다. (1 <= T <= 1000)
 * 매 테스트 케이스 첫째 줄에 n과 m 이 공백으로 구분되어 입력된다. (1 <= n, m <= 20)
 * 둘째 줄에 n x m 개의 위치에 매장된 금의 개수가 공백으로 구분되어 입력된다.
 *
 * 출력:
 * 테스트 케이스마다 채굴자가 얻을 수 있는 금의 최대 크기를 출력한다.
 * 각 테스트 케이스는 줄 바꿈을 이용해 구분한다.
 * */
public class GoldMine {
}
