package dynamic_programming;

/** 병사 배치하기
 *
 * N명 병사가 무작위로 나열되어 있다. 각 병사는 특정한 값의 전투력을 보유하고 있다.
 * 병사를 배치할 때는 전투력이 높은 병사가 앞쪽애 오도록 내림차순으로 배치를 하고자 한다.
 * 앞쪽에 있는 병사의 전투력이 항상 뒤쪽에 있는 병사보다 높아야 한다.
 * 또한 배치 과정에서는 특정한 위치에 있는 병사를 열외시키는 방법을 이용한다.
 * 그러면서도 남아 있는 병사의 수가 최대가 되도록 하는 방법을 구하라
 *
 * 입력:
 * 첫째 줄에 N이 주어진다. (1 <= N <= 2000) 둘째 줄에 각 병사의 전투력이 공백으로 구분되어 차례대로 주어진다.
 * 각 병사의 전투력은 10,000,000보다 작거나 같은 자연수이다.
 * 출력:
 * 첫째 줄에 남아 있는 병사의 수가 최대가 되도록 하기 위해서 열외시켜야 하는 병사의 수를 출력한다.
 *
 */
public class soldier {
    public static void main(String[] args) {

    }
}
